// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
 int num = 7;

if  (num >= 6 && num <= 7)
    {
        Console.WriteLine ("Это день выходной");
    }
else 
{
   Console.WriteLine ("Это день будний");  
}
  